Tekla Open API Reference for Tekla Structures 2025
Distance.CurrentUnitType Property
 Gets or sets the current unit type.
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static Distance.UnitType CurrentUnitType { get; set; }
Public Shared Property CurrentUnitType As Distance.UnitType
	Get
	Set
Property Value
Type: Distance.UnitType
 The current unit type.
Examples
 This example shows how to specify the current unit type.
using Tekla.Structures.Datatype;
using System.Globalization;
public class Example
{
       public void Example1()
       {
           // Current unit type controls the default unit type used in parsing.
           Distance.CurrentUnitType = Distance.UnitType.Millimeter;
           Distance distance = Distance.Parse("30.2", CultureInfo.InvariantCulture);
       }
}
See Also
Reference
Distance Structure
Tekla.Structures.Datatype Namespace